Revit 2024 API
RebarContainerParameterManager.ClearOverrides Method
 Clears any overridden values from all parameters of the associated RebarContainer element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public void ClearOverrides()
Visual Basic
Public Sub ClearOverrides
Visual C++
public:
void ClearOverrides()
See Also
RebarContainerParameterManager Class
Autodesk.Revit.DB.Structure Namespace